Terraform plan output:
```
piz@piz-macbookpro:~/Documents/gitrepo/ml-auto-solutions-github/deployment$ terraform plan
data.google_client_config.provider: Reading...
google_bigquery_dataset.dataset_setup["xlml_dataset"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/xlml_dataset]
google_bigquery_dataset.dataset_setup["dev_benchmark_dataset"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/dev_benchmark_dataset]
google_bigquery_dataset.dataset_setup["benchmark_dataset"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/benchmark_dataset]
google_bigquery_dataset.dataset_setup["dev_xlml_dataset"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/dev_xlml_dataset]
google_container_cluster.gpu-uc1: Refreshing state... [id=projects/cloud-ml-auto-solutions/locations/us-central1/clusters/gpu-uc1]
data.google_client_config.provider: Read complete after 0s [id=projects/<null>/regions/<null>/zones/<null>]
google_project_service.composer_api: Refreshing state... [id=cloud-ml-auto-solutions/composer.googleapis.com]
google_service_account.custom_service_account["ml-automation-solutions-dev"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/serviceAccounts/ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_service_account.custom_service_account["ml-automation-solutions"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/serviceAccounts/ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.service_account_admin_role["ml-automation-solutions-dev"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/iam.serviceAccountAdmin/serviceAccount:ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.service_account_admin_role["ml-automation-solutions"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/iam.serviceAccountAdmin/serviceAccount:ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.service_account_user_role["ml-automation-solutions"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/iam.serviceAccountUser/serviceAccount:ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.service_account_user_role["ml-automation-solutions-dev"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/iam.serviceAccountUser/serviceAccount:ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_service_account_iam_member.custom_service_account["ml-automation-solutions"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/serviceAccounts/ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com/roles/composer.ServiceAgentV2Ext/serviceAccount:service-24860729792@cloudcomposer-accounts.iam.gserviceaccount.com]
google_service_account_iam_member.custom_service_account["ml-automation-solutions-dev"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/serviceAccounts/ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com/roles/composer.ServiceAgentV2Ext/serviceAccount:service-24860729792@cloudcomposer-accounts.iam.gserviceaccount.com]
module.composer["ml-automation-solutions-dev"].google_composer_environment.example_environment: Refreshing state... [id=projects/cloud-ml-auto-solutions/locations/us-central1/environments/ml-automation-solutions-dev]
module.composer["ml-automation-solutions"].google_composer_environment.example_environment: Refreshing state... [id=projects/cloud-ml-auto-solutions/locations/us-central1/environments/ml-automation-solutions]
google_project_iam_member.composer_worker_role["ml-automation-solutions"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/composer.worker/serviceAccount:ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.composer_worker_role["ml-automation-solutions-dev"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/composer.worker/serviceAccount:ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.monitoring_viewer_role["ml-automation-solutions"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/monitoring.viewer/serviceAccount:ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.monitoring_viewer_role["ml-automation-solutions-dev"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/monitoring.viewer/serviceAccount:ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.vertex_ai_admin_role["ml-automation-solutions"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/aiplatform.admin/serviceAccount:ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.vertex_ai_admin_role["ml-automation-solutions-dev"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/aiplatform.admin/serviceAccount:ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.compute_instance_admin_role["ml-automation-solutions"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/compute.instanceAdmin.v1/serviceAccount:ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.compute_instance_admin_role["ml-automation-solutions-dev"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/compute.instanceAdmin.v1/serviceAccount:ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.artifact_registry_admin_role["ml-automation-solutions-dev"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/artifactregistry.admin/serviceAccount:ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.artifact_registry_admin_role["ml-automation-solutions"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/artifactregistry.admin/serviceAccount:ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.storage_admin_role["ml-automation-solutions"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/storage.admin/serviceAccount:ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.storage_admin_role["ml-automation-solutions-dev"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/storage.admin/serviceAccount:ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.big_query_admin_role["ml-automation-solutions-dev"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/bigquery.admin/serviceAccount:ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.big_query_admin_role["ml-automation-solutions"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/bigquery.admin/serviceAccount:ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.project_iam_admin_role["ml-automation-solutions-dev"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/resourcemanager.projectIamAdmin/serviceAccount:ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.project_iam_admin_role["ml-automation-solutions"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/resourcemanager.projectIamAdmin/serviceAccount:ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.tpu_admin_role["ml-automation-solutions"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/tpu.admin/serviceAccount:ml-auto-solutions@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_project_iam_member.tpu_admin_role["ml-automation-solutions-dev"]: Refreshing state... [id=cloud-ml-auto-solutions/roles/tpu.admin/serviceAccount:ml-auto-solutions-dev@cloud-ml-auto-solutions.iam.gserviceaccount.com]
google_bigquery_table.table_setup["xlml_dataset-metric_history"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/xlml_dataset/tables/metric_history]
google_bigquery_table.table_setup["dev_benchmark_dataset-job_history"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/dev_benchmark_dataset/tables/job_history]
google_bigquery_table.table_setup["dev_xlml_dataset-metadata_history"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/dev_xlml_dataset/tables/metadata_history]
google_bigquery_table.table_setup["dev_benchmark_dataset-metric_history"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/dev_benchmark_dataset/tables/metric_history]
google_bigquery_table.table_setup["benchmark_dataset-metadata_history"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/benchmark_dataset/tables/metadata_history]
google_bigquery_table.table_setup["dev_benchmark_dataset-metadata_history"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/dev_benchmark_dataset/tables/metadata_history]
google_bigquery_table.table_setup["dev_xlml_dataset-job_history"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/dev_xlml_dataset/tables/job_history]
google_bigquery_table.table_setup["benchmark_dataset-metric_history"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/benchmark_dataset/tables/metric_history]
google_bigquery_table.table_setup["xlml_dataset-metadata_history"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/xlml_dataset/tables/metadata_history]
google_bigquery_table.table_setup["xlml_dataset-job_history"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/xlml_dataset/tables/job_history]
google_bigquery_table.table_setup["benchmark_dataset-job_history"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/benchmark_dataset/tables/job_history]
google_bigquery_table.table_setup["dev_xlml_dataset-metric_history"]: Refreshing state... [id=projects/cloud-ml-auto-solutions/datasets/dev_xlml_dataset/tables/metric_history]
google_container_node_pool.primary: Refreshing state... [id=projects/cloud-ml-auto-solutions/locations/us-central1/clusters/gpu-uc1/nodePools/primary-pool]
google_container_node_pool.nvidia-v100x2: Refreshing state... [id=projects/cloud-ml-auto-solutions/locations/us-central1/clusters/gpu-uc1/nodePools/nvidia-v100x2-pool]
kubernetes_service.example: Refreshing state... [id=default/headless-svc]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_container_cluster.benchmarking-gpu-uc1 will be created
  + resource "google_container_cluster" "benchmarking-gpu-uc1" {
      + cluster_ipv4_cidr           = (known after apply)
      + datapath_provider           = (known after apply)
      + default_max_pods_per_node   = (known after apply)
      + enable_binary_authorization = false
      + enable_intranode_visibility = (known after apply)
      + enable_kubernetes_alpha     = false
      + enable_l4_ilb_subsetting    = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = true
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + label_fingerprint           = (known after apply)
      + location                    = "us-central1"
      + logging_service             = (known after apply)
      + master_version              = (known after apply)
      + monitoring_service          = (known after apply)
      + name                        = "benchmarking-gpu-uc1"
      + network                     = "default"
      + networking_mode             = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + operation                   = (known after apply)
      + private_ipv6_google_access  = (known after apply)
      + project                     = "cloud-ml-benchmarking"
      + remove_default_node_pool    = true
      + self_link                   = (known after apply)
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)

      + release_channel {
          + channel = "RAPID"
        }
    }

  # google_container_cluster.gpu-uc1 will be updated in-place
  ~ resource "google_container_cluster" "gpu-uc1" {
        id                          = "projects/cloud-ml-auto-solutions/locations/us-central1/clusters/gpu-uc1"
        name                        = "gpu-uc1"
        # (26 unchanged attributes hidden)

        # (18 unchanged blocks hidden)
    }

  # google_container_node_pool.benchmarking-primary will be created
  + resource "google_container_node_pool" "benchmarking-primary" {
      + cluster                     = "benchmarking-gpu-uc1"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "benchmarking-primary-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = 1
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "cloud-ml-benchmarking"
      + version                     = (known after apply)

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "e2-medium"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = (known after apply)
          + spot              = false
          + taint             = (known after apply)
        }
    }

  # google_container_node_pool.nvidia-H100x1 will be created
  + resource "google_container_node_pool" "nvidia-H100x1" {
      + cluster                     = "benchmarking-gpu-uc1"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "us-central1"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "nvidia-H100x1-pool"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = [
          + "us-central1-a",
        ]
      + operation                   = (known after apply)
      + project                     = "cloud-ml-benchmarking"
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = (known after apply)
          + max_node_count  = 6
          + min_node_count  = 2
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 500
          + disk_type         = "pd-balanced"
          + guest_accelerator = [
              + {
                  + count                          = 8
                  + gpu_driver_installation_config = [
                      + {
                          + gpu_driver_version = "LATEST"
                        },
                    ]
                  + type                           = "nvidia-h100-80gb"
                },
            ]
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + logging_variant   = "DEFAULT"
          + machine_type      = "a3-highgpu-8g"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = true
          + service_account   = (known after apply)
          + spot              = false
          + taint             = (known after apply)
        }
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.
```